In [6]:
import pandas as pd
import numexpr

In [11]:
df = pd.read_csv('https://raw.githubusercontent.com/pandas-dev/pandas/main/doc/data/titanic.csv')

In [12]:
df = pd.concat([df.copy() for i in range(1000)],ignore_index=True)

In [13]:
df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
890995,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
890996,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
890997,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
890998,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890999,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [14]:
df = df.sample(len(df),)

In [15]:
print(df)

        PassengerId  Survived  Pclass  \
636266           93         0       1
393862           41         0       3
46406            75         1       3
48674           561         0       3
405636          232         0       3
...             ...       ...     ...
318138           52         0       3
666605          138         0       1
232134          475         0       3
161342           72         0       3
876401          549         0       3

                                                  Name     Sex   Age  SibSp  \
636266                     Chaffee, Mr. Herbert Fuller    male  46.0      1
393862  Ahlin, Mrs. Johan (Johanna Persdotter Larsson)  female  40.0      1
46406                                    Bing, Mr. Lee    male  32.0      0
48674                         Morrow, Mr. Thomas Rowan    male   NaN      0
405636                        Larsson, Mr. Bengt Edvin    male  29.0      0
...                                                ...     ...   ...    ...
318138                    Nosworthy, Mr. Richard Cater    male  21.0      0
666605                     Futrelle, Mr. Jacques Heath    male  37.0      1
232134                     Strandberg, Miss. Ida Sofia  female  22.0      0
161342                      Goodwin, Miss. Lillian Amy  female  16.0      5
876401                       Goldsmith, Mr. Frank John    male  33.0      1

        Parch       Ticket     Fare Cabin Embarked
636266      0  W.E.P. 5734  61.1750   E31        S
393862      0         7546   9.4750   NaN        S
46406       0         1601  56.4958   NaN        S
48674       0       372622   7.7500   NaN        Q
405636      0       347067   7.7750   NaN        S
...       ...          ...      ...   ...      ...
318138      0   A/4. 39886   7.8000   NaN        S
666605      0       113803  53.1000  C123        S
232134      0         7553   9.8375   NaN        S
161342      2      CA 2144  46.9000   NaN        S
876401      1       363291  20.5250   NaN        S

[891000 rows x 12 columns]

In [16]:
pq=((df['PassengerId']/2.21 >= 150)
&(df['Fare']*10.4431 <= 80)
&(df['Survived']*134.41>0))
%timeit pq=((df['PassengerId']/2.21 >= 150) &(df['Fare']*10.4431 <= 80) &(df['Survived']*134.41>0))

2.99 ms ± 85.7 µs per loop (mean ± std. dev. of 7 runs, 100 loops each)

In [17]:
a,b,c=(df['PassengerId'].__array__(),
       df['Fare'].__array__() ,
       df['Survived'].__array__())
numexpr.evaluate('(a/2.21 >= 150) & (b*10.4431 <= 80) & (c*134.41>0)')
%timeit numexpr.evaluate('(a/2.21 >= 150) & (b*10.4431 <= 80) & (c*134.41>0)')

1.29 ms ± 28.5 µs per loop (mean ± std. dev. of 7 runs, 1,000 loops each)